# Data Visualization Exam

In [1]:
import pandas as pd
import plotly.graph_objs as go
import plotly.express as px

import gzip
import shutil

## Data acquisition
CSV file creation from raw data and loading the CSV file into the program.

In [8]:
fileName = 'data/road_eqr_carpda'
with gzip.open(fileName+'.tsv.gz', 'rt') as f_in:
    s = f_in.read().replace('geo\\time','geo').replace('\t',',').replace(' ','')    #conversion to csv
    with open(fileName+'.csv', 'wt') as f_out:   # save to csv
        f_out.write(s)
        df = pd.read_csv(f_out.name)                  # load data from CSV to program

df.head() # data loaded

  unit mot_nrg geo    2019    2018    2017   2016   2015   2014   2013
0   NR     ALT  AT       :    7406    5868   4317   2389   2074   1285
1   NR     ALT  BE   12525    7931    5418   4413   2147   2234    841
2   NR     ALT  CH   14500    6200    5700   4500   5000   3000   2300
3   NR     ALT  CY     121      37      57     22      9      9     15
4   NR     ALT  DE  317634  181948  117998  65703  56202  50482  46534

## Data parsing

In [9]:
# Reorder columns chronologically
cols = df.columns.tolist()
cols = cols[0:3] + cols[:2:-1]
df = df[cols]
del cols

df.head()

# TODO: transform the data, e.g., get country names and geo-coordinates (e.g., for maps)
# TODO: check for errors in data, change type (?) and choose the level for hierachical data

  unit mot_nrg geo   2013   2014   2015   2016    2017    2018    2019
0   NR     ALT  AT   1285   2074   2389   4317    5868    7406       :
1   NR     ALT  BE    841   2234   2147   4413    5418    7931   12525
2   NR     ALT  CH   2300   3000   5000   4500    5700    6200   14500
3   NR     ALT  CY     15      9      9     22      57      37     121
4   NR     ALT  DE  46534  50482  56202  65703  117998  181948  317634

## Data filtering

In [ ]:
# TODO: decide what to do with missing data